//<!--学历-->
var data = [
    {'id': '1000','value': '小学'},
    {'id': '1002','value': '初中'},
    {'id': '1003','value': '高中'},
    {'id': '1004','value': '中专'},
    {'id': '1005','value': '大专'},
    {'id': '1006','value': '本科'},
    {'id': '1007','value': '研究生'},
    {'id': '1008','value': '博士'}
];
//<!--血型-->
var bool = [
    {'id': '1000','value': 'A'},
    {'id': '1002','value': 'B'},
    {'id': '1003', 'value': 'O'},
    {'id': '1004','value': 'AB'}
];
//<!--星座-->
var consta = [
    {'id': '1000','value': '双鱼座'},
    {'id': '1002','value': '金牛座'},
    {'id': '1003','value': '处女座'},
    {'id': '1004','value': '狮子座'},
    {'id': '1005','value': '白羊座'},
    {'id': '1006','value': '天枰座'},
    {'id': '1007','value': '摩羯座'},
    {'id': '1008','value': '天蝎座'}
];
//<!--民族-->
var nat = [
    {'id': '1000','value': '汉族'},
    {'id': '1002','value': '苗族'},
    {'id': '1003','value': '壮族'},
    {'id': '1004','value': '回族'},
    {'id': '1005','value': '俄罗斯族'},
    {'id': '1006','value': '朝鲜族'},
    {'id': '1007','value': '满族'},
    {'id': '1008','value': '维吾尔族'}
];
//<!--居住-->
var live = [
    {'id': '1000','value': '暂未购房'},
    {'id': '1002','value': '已购房（有贷款）'},
    {'id': '1003','value': '已购房（无贷款）'},
    {'id': '1004','value': '与人合作'},
    {'id': '1005','value': '独自租房'},
    {'id': '1006','value': '与父母同住'},
    {'id': '1007','value': '已有两套房以上'},
    {'id': '1008','value': '住单位房'}
];
//<!--婚姻-->
var Marr = [
    {'id': '1000','value': '已婚'},
    {'id': '1002','value': '未婚'},
    {'id': '1003', 'value': '同性'},
    {'id': '1004','value': '丧偶'}
];
//<!--月薪-->
var monthly = [
    {'id': '1000','value': '2000以下'},
    {'id': '1002','value': '2000-4000'},
    {'id': '1003', 'value': '4000-6000'},
    {'id': '1004','value': '6000以上'}
];
//<!--购车情况-->
var buye = [
    {'id': '1000','value': '暂未购车'},
    {'id': '1002','value': '已购车（经济型）'},
    {'id': '1003', 'value': '单位购车'},
    {'id': '1004','value': '需要时购置'}
];

//<!--职业-->
var occupa = [
    {'id': '1000','value': '实习生'},
    {'id': '1002','value': '待业'},
    {'id': '1003', 'value': '私营业主'},
    {'id': '1004','value': '退休'}
];

//月账单日期查询
var suData = [
    {'id': '10001', 'value': '2017年'},
    {'id': '10002', 'value': '2018年'},
    {'id': '10003', 'value': '2019年'},
    {'id': '10004', 'value': '2020年'},
    {'id': '10005', 'value': '2021年'},
    {'id': '10006', 'value': '2022年'},
    {'id': '10007', 'value': '2023年'},
    {'id': '10008', 'value': '2024年'}
];
var weiData = [
    {'id': '20001', 'value': '1月'},
    {'id': '20002', 'value': '2月'},
    {'id': '20003', 'value': '3月'},
    {'id': '20004', 'value': '4月'},
    {'id': '20005', 'value': '5月'},
    {'id': '20006', 'value': '6月'},
    {'id': '20007', 'value': '7月'},
    {'id': '20008', 'value': '8月'},
    {'id': '20009', 'value': '9月'},
    {'id': '20010', 'value': '10月'},
    {'id': '20011', 'value': '11月'},
    {'id': '20012', 'value': '12月'}
];
















